[
{"date": "Jul 07, 2020", "title": "VTB Announces New Appointments at VTBBank (Europe) SE and VTBCapital plc", "content": "Nick Hutt has been appointed as Chairman of the Management Board at VTBBank (Europe) SE. In this role, he will be responsible for executing the bank’s strategy in Europe with a focus on further developing lending capabilities, facilitating trade flow for European and Russian clients, and providing customized financing solutions and services featuring a variety of capital and product structures. In this role Nick Hutt will be replacing Arthur Iliyav, who is leaving VTB Group to pursue other opportunities. VTBCapital plc will be headed by Mark Richardson following regulatory approvals. Mark has been with VTBCapital for 10 years, holding the roles of Global Head of Equities and Vice Chairman of VTBCapital International. Yuri Soloviev, First Deputy President and Chairman of VTBBank, said: “We would like to extend our thanks to Arthur Iliyav, who has led the bank through the merger process, which combined VTB Group’s three banks in Continental Europe into a single new entity and allowed for an increased level of operation efficiency. Over the last few years we have been particularly focused on our European operations footprint, and I believe Nick Hutt, who has extensive experience at VTB Group and expertise in the investment banking business, will lead VTBBank (Europe) SE’s team towards further growth, introducing new products and services in line with our client’s needs. I am confident that Mark Richardson, who has efficiently managed VTBCapital's equities division for a long time, will continue to maintain the investment bank's leading positions going forward.\" Nick Hutt joined VTBCapital in September 2008 to head the International finance team and became VTBCapital plc’s CEO in 2014. In the 11 years prior to joining VTBCapital, Nick held a number of senior finance positions in the investment banking market. He joined VTBCapital from Deutsche Bank where he was Global Head of Emerging Markets Product Control. Nick is a CIMA qualified Chartered Accountant and holds an Honours Degree in Physics from Loughborough University."},
{"date": "Aug 29, 2014", "title": "Delay of payment transactions", "content": "Dear customers and business partners of our bank, we have noticed that payments executed by us in some cases are not being transferred by intermediate banks immediately. The delays are explained to us to be connected with additional inspection needs in connection with the current sanctions, although the VTB Bank (Deutschland) AG, Frankfurt is not subject to the sanctions. We do our most possible in order to secure an immediate transfer of all payments. Unfortunately, we have no influence on the behavior of other banks. We sincerely apologize for the inconvenience this may have caused. Thank you for your understanding and your patience. If you have any questions, please contact the person responsible for you entity.  Best regardsYour VTB Bank (Deutschland) AG"},
{"date": "Feb 27, 2015", "title": "VTB Bank (Deutschland) AG sponsors 2015 Russia Economic Conference", "content": "The \"Russia 2015\" Economic Conference was held in Frankfurt, Germany, between February 25 and 26, 2015. This is already the second occasion on which this conference has been staged in Frankfurt. More than 100 participants from highly varied economic sectors attended (including auditing firms, logistics companies and management consultancies etc). This event was held under the motto \"Successfully mastering current challenges in Russia, and optimally exploiting market opportunities\". Given current sanctions against Russia, this year's event focused on exports to, and investments in, Russia. Focal topical points included:Consequences of sanctionsStructuring contracts in Russia, and operating branch operationsCurrent business opportunities and challengesCustoms law, customs processing and certificationThe Eurasian Economic Union  VTB Bank (Deutschland) AG was represented with a lecture entitled\"Banks in the crossfire between trade and sanctions\". Mr. Sebastian Glaab, Head of AML/Compliance, and Mr. Boris Vaichanski, Vice President Financial Institutions, presented this lecture.Many questions about sanctions were posed during this talk, which the presenters answered in detail. Despite current tensions in political relationships, Germany remains Russia's third most important trade partner worldwide. As with all other VTB units located within the European Union, VTB Bank (Deutschland) AG is not affected by existing EU sanctions against ultimate Group parent entity JSC VTB Bank. As VTB Bank (Deutschland) AG is a German public stock corporation under German law, which has also been subject, as a significant bank, to ECB supervision since November 2014, it is explicitly excluded from sanctions as a European subsidiary in the meaning of the directive text. Consequently, the bank is still able to offer and settle banking transactions. The bank regards itself as a bridgehead between Europe and the CIS states. Thanks to VTB's enormous presence in the CIS states, VTB Bank (Deutschland) AG is able to leverage synergies from cross-border transactions and to profile itself as a reliable partner. As a bank supervised by both the ECB and the German Federal Financial Supervisory Authority (BaFin), VTB Bank (Deutschland) AG complies with all regulatory requirements. ECB and BaFin banking regulation transmit a high degree of security and reliability for clients.  You can find additional coverage of the event on these websites (in german): http://www.kongress-russland.de/ http://www.dw.de/frankfurt-wirtschaftskongress-russland/av-18282402"},
{"date": "Feb 08, 2013", "title": "VTB Bank (Deutschland) AG launches VTB Corporate MasterCard", "content": "Specialized bank for German-Russian trade relations helps clients' worldwide, non-cash payments  Starting February 2013, corporate customers of VTB Bank (Deutschland) AG may use the new VTB Corporate MasterCard, a globally accepted and flexible means of payment. It liberates them from risky and complicated cash transactions, thereby saving time and money and creating financial freedom. Find more informationhere.  With the introduction of their own line of credit cards, VTB Bank (Deutschland) AG rounds out their product package for their corporate clients. Dr. Valeriy Lyakin, the executive manager responsible for the market segment of the bank said: \"At all times, VTB Bank (Deutschland) AG offers its customers individual, efficient and intelligent solutions. Moreover, we want to provide sustainable competitive advantages to our customers. So we are looking forward to introducing VTB Corporate Mastercard. Employees of our business customers can now pay all their business transactions easily and conveniently and thus simplify the accounting processes significantly, which will even reduce their cost in the near future.\"  Cost reduction is an important goal in many companies, and especially operation processes usually create hardly identifiable and controllable overheads. With VTB Corporate MasterCard and its free service feature \"Credit Card Info Online\", administrative activities simplify, quick transaction information is available and account data are accessible on the website of VTB Deutschland.  All other benefits of the new VTB Corporate MasterCard are also aligned to the needs of corporate customers. Convenient monthly billing collection, global cash services at ATMs and secure online payments with MasterCard's SecureCodeTMincrease efficiency and guarantee satisfaction of business customers.  Of course, VTB Bank (Deutschland) AG provides excellent service when using the VTB Corporate MasterCard, being supported by service provider First Data Deutschland (GmbH), a leading provider of e-commerce and electronic payment solutions, which ensures smooth processes.    VTB Bank (Deutschland) AG at a glance  VTB Bank (Deutschland) AG is a commercial and specialized bank for German-Russian trade relations. For over 40 years the bank has been a competent and reliable partner to their clients in helping their business in Russia and the Commonwealth of Independent States (CIS) with advisory and execution services. The bank has an extensive know-how and market-specific expertise, excellent contacts to the Russian market as well as competent staff capable of concrete, fast, focused and flexible solutions to address the needs of corporate customers.  VTB Bank (Deutschland) AG is a member of the VTB Banking Group, which is listed at the stock exchanges in London and Moscow. VTB Bank is the second largest Russian bank, and it is the largest Foreign Trade Bank of the Russian Federation. It offers not only its own expertise, but also the networking benefits of an internationally active commercial bank.  VTB Bank, measured at its total assets, belongs to the 100 largest banks in the world, and has a geographically unique network of approximately 1,000 branches in Russia, and many offices and subsidiaries in the CIS countries, Europe and the Emerging Markets.  For more information:http://www.vtb.de     Contact:  VTB Bank (Deutschland) AG Walter-Kolb-Strasse 13 60594 Frankfurt am Main Deutschland  Telefon.: +49-69-2168-0 Telefax: +49-69-2168-6319 E-Mail:presse@vtb.de"},
{"date": "Sep 24, 2013", "title": "VTB Bank (Deutschland) AG participates in $675 million financing for Gunvor Group Ltd", "content": "Specialist bank for German-Russian trade relations further expands business in Russia  VTB Bank (Deutschland) AG is significantly involved as an arranger of a financing facility led by Credit Suisse for the Ust-Luga Terminal near St. Petersburg, which ranks as one of the world's largest terminals with 30 million tonnes of goods turnover. The investor, Gunvor Group Ltd, is thereby expanding its market position as one of the world's leading energy sector companies. The total financing volume amounts to $675 million.  Peter Petrik, the Head of Corporate Banking at VTB Bank (Deutschland) AG who was responsible for this deal, commented as follows: \"VTB Bank (Deutschland) AG sees itself not just as a specialist bank for German-Russian trade relations, but especially also as a reliable business partner for investments in Russia, as well as, in the other direction, for Russian companies in Europe. Our close business contacts are reflected in numerous major projects. Given the high lending volume entailed, the financing of the Ust-Luga Terminal is of outstanding significance for us. We will continue to be a strong and reliable partner at our customers' side, further expanding our unique expertise on the Russian and European markets.\"    VTB Bank (Deutschland) AG at a glance  VTB Bank (Deutschland) AG is a commercial and specialized bank for German-Russian trade relations. For over 40 years the bank has been a competent and reliable partner to their clients in helping their business in Russia and the Commonwealth of Independent States (CIS) with advisory and execution services. The bank has an extensive know-how and market-specific expertise, excellent contacts to the Russian market as well as competent staff capable of concrete, fast, focused and flexible solutions to address the needs of corporate customers.  VTB Bank (Deutschland) AG is a member of the VTB Banking Group, which is listed at the stock exchanges in London and Moscow. VTB Bank is the second largest Russian bank, and it is the largest Foreign Trade Bank of the Russian Federation. It offers not only its own expertise, but also the networking benefits of an internationally active commercial bank.  VTB Bank, measured at its total assets, belongs to the 100 largest banks in the world, and has a geographically unique network of approximately 1,000 branches in Russia, and many offices and subsidiaries in the CIS countries, Europe and the Emerging Markets.  For more information:http://www.vtb.de    Contact:  VTB Bank (Deutschland) AG Walter-Kolb-Strasse 13 60594 Frankfurt am Main Deutschland  Telefon.: +49-69-2168-0 Telefax: +49-69-2168-6319 E-Mail:presse@vtb.de"},
{"date": "Sep 30, 2013", "title": "VTB Bank (Deutschland) AG appoints Alexander Frey to the Management Board", "content": "Specialist German-Russian trade bank appoints new senior manager  VTB Bank (Deutschland) AG has appointed Alexander Frey as the new member of its Management Board effective 30 September 2013. He will initially join Axel Breitbach as head of the middle- and back-office areas and take responsibility for the Risk/Controlling, International Payments, Legal and AML/Compliance departments. Mr Frey has headed the Legal department at VTB Bank (Deutschland) AG since 2010 and was appointed as fully authorised representative in this capacity in 2011. As a qualified lawyer, he has an extensive background as in-house council specialising in banking organisation and operations in an international environment.  CEO Dr. Valeriy Lyakin remarked that “as the new member of our Management Board, we wanted an ambitious and dependable personality of the calibre of Alexander Frey, who not only represents the values of the Bank but also has the ability to realise our visions of the future. We are delighted to welcome Mr Frey as our new Management Board member, not least because his appointment underscores our commitment to the highest competence and our desire to offer our clients the optimum services with genuine competitive advantages. We are a strong and flexible partner, and we shall continue to develop our involvement in the Russian and European market.”  Mr Frey has already been supporting the management for several years and is regarded as a specialist in the legal aspects of banking operations. “I am delighted with my new position at VTB Bank (Deutschland) AG and with the responsibility it entails,” he said. “The main focus of my work will be on risk management and the renewal of internal processes and systems. I would also like to express my thanks for the confidence and support of the staff, who play a major role in the achievements of the Bank and are instrumental in helping us to write new chapters in our success story.”   VTB Bank (Deutschland) AG at a glance  VTB Bank (Deutschland) AG is a commercial and specialized bank for German-Russian trade relations. For over 40 years the bank has been a competent and reliable partner to their clients in helping their business in Russia and the Commonwealth of Independent States (CIS) with advisory and execution services. The bank has an extensive know-how and market-specific expertise, excellent contacts to the Russian market as well as competent staff capable of concrete, fast, focused and flexible solutions to address the needs of corporate customers.  VTB Bank (Deutschland) AG is a member of the VTB Banking Group, which is listed at the stock exchanges in London and Moscow. VTB Bank is the second largest Russian bank, and it is the largest Foreign Trade Bank of the Russian Federation. It offers not only its own expertise, but also the networking benefits of an internationally active commercial bank.  VTB Bank, measured at its total assets, belongs to the 100 largest banks in the world, and has a geographically unique network of approximately 1,000 branches in Russia, and many offices and subsidiaries in the CIS countries, Europe and the Emerging Markets.   Contact:   VTB Bank (Deutschland) AG Walter-Kolb-Strasse 13 60594 Frankfurt am Main Deutschland  Telefon.: +49-69-2168-0 Telefax: +49-69-2168-6319 E-Mail:presse@vtb.de"},
{"date": "Feb 01, 2014", "title": "VTB Bank (Deutschland) AG makes the change to SEPA", "content": "Bank specialising in German-Russian trade relations fulfils the requirements of the SEPA guidelines enforced from 1 February 2014  VTB Bank (Deutschland) AG is fulfilling the requirements of the SEPA guidelines for the new Single Euro Payments Area which have been in force since 1 February 2014. Cashless transactions like wire transfers and direct debits in EUR from and to other European countries are now just as simple, fast and good value as those made domestically, as the payments are processed in the same way and are standardised across Europe.  Jens Kleinwächter, Head of Global Transaction Banking at VTB Bank (Deutschland) AG comments: \"Our customers benefit greatly from the change as specific country-specific regulations no longer have to be taken into account. In the long term, corresponding synergy effects will also be generated. We are delighted to have already made all the necessary adjustments by today. This once again shows that we are able to react quickly and flexibly to new framework conditions, and in doing so provide our customers with the best possible service.\"  The SEPA switch has posed major challenges for some banks and companies. In order to avoid payment chaos in Europe, the EU Commission therefore decided to ensure a transition period of 6 months stretching from 22 January 2014 to 1 August 2014. During this period, money transfers undertaken by companies and associations may still be made in the previous format.   VTB Bank (Deutschland) AG at a glance  VTB Bank (Deutschland) AG is a commercial and specialized bank for German-Russian trade relations. For over 40 years the bank has been a competent and reliable partner to their clients in helping their business in Russia and the Commonwealth of Independent States (CIS) with advisory and execution services. The bank has an extensive know-how and market-specific expertise, excellent contacts to the Russian market as well as competent staff capable of concrete, fast, focused and flexible solutions to address the needs of corporate customers.  VTB Bank (Deutschland) AG is a member of the VTB Banking Group, which is listed at the stock exchanges in London and Moscow. VTB Bank is the second largest Russian bank, and it is the largest Foreign Trade Bank of the Russian Federation. It offers not only its own expertise, but also the networking benefits of an internationally active commercial bank.  VTB Bank, measured at its total assets, belongs to the 100 largest banks in the world, and has a geographically unique network of approximately 1,000 branches in Russia, and many offices and subsidiaries in the CIS countries, Europe and the Emerging Markets.   Contact VTB Bank (Deutschland) AG Rüsterstraße 7-9 60325 Frankfurt am Main Deutschland  Telefon.: +49-69-2168-0 Telefax: +49-69-2168-6319 E-Mail:presse@vtb.de"},
{"date": "Jul 01, 2013", "title": "Amendment to the Foreign Trade and Payments Act", "content": "The Federal Ministry of Economics and Technology is currently preparing an amendment to the Foreign Trade and Payments Act (Außenwirtschaftsgesetz) and the Foreign Trade and Payments Regulation (Außenwirtschaftsverordnung), which is scheduled to be adopted by the parliamentary committees within the current legislative period.  Since July 2013, transactions and stocks will have to be reported to the Deutsche Bundesbank in line with the new provisions.   Overview of the most important changes:  - Electronic submission of reports to become mandatory - Submission via banks to be dropped (abolition of Annex Z1 to the Foreign Trade and Payments Regulation) - Extension of transaction and stock reports  Find further information of the Deutsche Bundesbankhere."},
{"date": "Jul 31, 2014", "title": "VTB Bank (Deutschland) AG excluded from EU sanctions", "content": "Dear customers and business partners of our bank,  According to a decree/regulation published in the Official Journal of the European Union (L 229) on July 31, 2014, all units of VTB Bank, located in the European Union, are excluded from the application of sanctions on the basis of explicit solutions.  Thus, VTB Bank (Deutschland) AG is continuing its efforts/business without any restrictions.  If you have any questions, please contact the person responsible for you entity. Best regardsYour VTB Bank (Deutschland) AG"},
{"date": "Dec 16, 2013", "title": "VTB Bank (Deutschland) AG moves into new corporate headquarters", "content": "Specialist bank for German-Russian trade relations moves into its new building in Frankfurt am Main  As of December 16, 2013, VTB Bank (Deutschland) AG is moving into a new building at the heart of the German financial metropolis of Frankfurt am Main. This new location in one of Frankfurt's best city districts provides for optimal modern and attractive working conditions, as well as a representative external presentation.  This move to a new representative building comprises an important cornerstone for the bank's future strategic orientation, reflecting not only the past years' successful work but also the future orientation of VTB Bank (Deutschland) AG. VTB Bank (Deutschland) AG is thereby underscoring its long-term development, enjoying an important base from which to drive ahead with optimising its own internal and external presentation, as well as anchoring its market position.  Management Board member Alexander Frey commented as follows: \"This move represents much more than just a change of working environment for us. It's not just a new office. Rather, it opens up entirely new prospects for the future of VTB Bank (Deutschland) AG. We wish to offer our staff optimal working conditions as, after all, they put their knowledge and experience to our clients' service on a daily basis, thereby creating the foundation for the bank's long-term success. We would also like to show our customers that we are a reliable partner that is pursuing ambitious goals and sets high standards for itself. We form part of the VTB Group, perhaps the most important foreign trade bank in the Russian Federation, and this move underscores this outstanding position.\"   VTB Bank (Deutschland) AG at a glance  VTB Bank (Deutschland) AG is a commercial and specialized bank for German-Russian trade relations. For over 40 years the bank has been a competent and reliable partner to their clients in helping their business in Russia and the Commonwealth of Independent States (CIS) with advisory and execution services. The bank has an extensive know-how and market-specific expertise, excellent contacts to the Russian market as well as competent staff capable of concrete, fast, focused and flexible solutions to address the needs of corporate customers.  VTB Bank (Deutschland) AG is a member of the VTB Banking Group, which is listed at the stock exchanges in London and Moscow. VTB Bank is the second largest Russian bank, and it is the largest Foreign Trade Bank of the Russian Federation. It offers not only its own expertise, but also the networking benefits of an internationally active commercial bank.  VTB Bank, measured at its total assets, belongs to the 100 largest banks in the world, and has a geographically unique network of approximately 1,000 branches in Russia, and many offices and subsidiaries in the CIS countries, Europe and the Emerging Markets.   Contact  VTB Bank (Deutschland) AG Rüsterstraße 7-9 60325 Frankfurt am Main Deutschland  Telefon.: +49-69-2168-0 Telefax: +49-69-2168-6319 E-Mail:presse@vtb.de"},
{"date": "Apr 21, 2015", "title": "VTB Bank (Deutschland) AG presents the 8th Correspondent Banking Forum in Moscow", "content": "On 26 March 2015, the most important CIS banks met under the patronage of the VTB Bank (Deutschland) AG in order to exchange their experiences on international cooperation, technical trends and payments perspectives.The tradition-steeped Correspondent Banking Forum took place in Russian's capital Moscow initiated and organized by. VTB Bank (Deutschland) AG. VTB Bank (Deutschland) AG uses the Correspondent Banking Forum for updating customers about new developments and products. Additionally the conference enables the bank to receive direct feedback from their customer regarding necessary improvements and optimization. The bank once again reaffirmed its competence and international market presence by bringing together an international network at top level. 200 representatives of 117 financial institutions banks participated the event.Topics like customer service, IT-optimization, e-banking, sanctions, compliance as well as international monetary transactions were presented by high-ranking executives of VTB Bank (Deutschland) AG.Elvira Petrik, Vice President, explains: „Our bank is particularly interested in the promotion of international cooperation and creating an open climate for communication. The Correspondent Banking Forum is an ideal platform for decision-makers and specialists of the CIS banking world to communicate. We promote the exchange of comprehensive knowledge in the field of foreign trade transactions between CIS and Europe and at the same time create a basis for a trusting and results-oriented cooperation. VTB Bank (Deutschland) AG offers a multitude of individual solutions for credit institutions, e.g. clearing and e-banking. But our key “product” is the 40-year experience on the German banking market.“Within the event the banks with the highest STP rates were honored with the VTB D STP Award.The participants confirmed the necessity to organize such a conference bi-yearly in an electronic survey. They appreciated the conference and described the conference as constructive event and communication platform. The 9th Correspondent Banking Forum is scheduled for 2017. Contact VTB Bank (Deutschland) AGRüsterstraße 7-960325 Frankfurt am MainDeutschlandTelefon: +49-69-2168-0Telefax: +49-69-2168-6319E-Mail:presse@vtb.de"},
{"date": "May 15, 2015", "title": "Publication of the Interview with the Board Member of VTB Bank (Deutschland) AG", "content": "Interview with Alexander Frey: Trade for the betterDownload"},
{"date": "Jun 16, 2015", "title": "German-Russian Association of Lawyers convenes at VTB Bank (Deutschland) AG in Frankfurt", "content": "The German-Russian Association of Lawyers (DRJV) held this year's annual event at the premises of VTB Bank (Deutschland) in Frankfurt. The DRJV addresses individuals who are interested in dialogue between German and Russian lawyers and legal interchange between these two countries. As part of the event, acknowledged and senior experts – mostly DRJV members – reported on current developments in German-Russian commercial law, as well as in other exciting legal areas. Examples of topics covered included Russian civil law, family law, labour law and law concerning aliens, compliance in Eastern European business, etc.The speakers provided an insight into the latest statutory changes, prevailing legal precedents and important planned legislation.Representing VTB Bank (Deutschland) AG, Dr. Lyakin, CEO, welcomed the guests, and Mr. Kai Scholz, Head of Legal, introduced the event. Mr. Sebastian Glaab, Head of AML/Compliance, spoke on the topic of compliance in Eastern European business.More than 80 participants from various companies and institutions attended the event. Both the event organisers and VTB Bank (Deutschland) AG agreed that the conference was a success for all participants."},
{"date": "Jun 10, 2016", "title": "VTB Bank (Deutschland) AG presents STP-Awards to correspondent Banks", "content": "A Delegation of VTB Bank (Deutschland) AG, lead by CEO Mr. V. Lyakin, presented a number of awards in the field of international payments (the STP-Awards) during a working visit to Moscow in May 2016. The STP-Awards recognize correspondent banks who exhibited an exceptionally high processing quality in International Payments in 2015. The awards were presented to to Bank Avangard, Zenit, Credit Bank of Moscow, Russian Agricultural Bank and TransKapitalbank. We appreciate the mutually beneficial long-term cooperation and thank our correspondents for their trust and professionalism.    Valeriy Lyakin (VTB Bank (Deutschland) AG) presents the STP-Award to Olga Gryadovaya (TransKapitalbank)  Valeriy Lyakin (VTB Bank (Deutschland) AG) presents the STP-Award to Bank Avangard (from left to right): Natalia Lesun, Galina Selezneva, Olga Brilliantova and Executive Vice-President Sergey Nikolaev"},
{"date": "Apr 24, 2017", "title": "VTB sponsored ice hockey team “Löwen Frankfurt” wins DEL2 championship", "content": "The Frankfurt ice hockey team “Löwen Frankfurt”, sponsored by VTB Direktbank, has won this year’s DEL2 championship. VTB Direktbank has been the main sponsor of the team since 2011. Arthur Iliyav, CEO of VTB Bank (Deutschland) AG, said: “The continuous excellent cooperation and partnership between VTB Direktbank and the team has demonstrated great results with the victory in this season’s DEL2 championship. The team has come a long way and we are proud of our contribution to this success.” VTB Group actively supports sports and other socially important initiatives across the regions of its presence, and partnership between VTB Direktbank and “Löwen Frankfurt” ice hockey team is a perfect example of this. Ice hockey is one of the most popular sports not only in Russia, but also in Frankfurt and the Rhein-Main region, so VTB’s cooperation with the team is a natural extension of its activities in the corporate social responsibility area. Frankfurt is expected to become VTB Group’s European Union headquarters, and VTB is committed to strengthening its position in continental Europe’s financial center not only as one of the leading international banking groups, but also as a company dedicated to its employees, clients and deeply involved in the life of local community.From left to right: Patricia Seidel – Junior Marketing Manager VTB Direktbank, Jan-Peter Kind – Managing Director VTB Direktbank, Nils Rahe – Senior Marketing Manager VTB Direktbank, Andreas Stracke – CEO Löwen Frankfurt Eishockey-Betriebs GmbH, Arthur Iliyav – CEO VTB Bank (Deutschland) AG, Oleg Osipenko – Member of the Board VTB Bank (Deutschland) AG, Stefan Krämer – CMO Löwen Frankfurt Eishockey-Betriebs GmbH"},
{"date": "Nov 29, 2017", "title": "Reorganization and name change of VTB Bank (Deutschland) AG", "content": "VTB Group has decided to reorganize its European operations. As a consequence thereof VTB Bank (Deutschland) AG will be transformed and renamed into:VTB Bank (Europe) SEand will be directly held by JSC VTB Bank. The transformation is scheduled to become effective on 29 December 2017.VTB Bank (Europe) SE as a legal successor assumes all assets and liabilities, rights and obligations of VTB Bank (Deutschland) AG."},
{"date": "Aug 05, 2011", "title": "International Payments: News on payment services for exotic currencies", "content": "To all of our clientsNew Payment Services for \"Exotic Currencies\" by using your EUR account as multi-currency account Dear Sirs, Doing business in a foreign currency has never been easier! Now Guaranteed-OUR payments for \"exotic currencies\" available. VTB Bank (Deutschland) AG, Frankfurt am Main, is excited to announce that we can now handle payments in over 120 currencies. This enhancement to our service means that you no longer need to access third-party providers for exotic currencies but can instead rely on VTB Bank (Deutschland) AG to ensure that funds will be received by the beneficiary regardless of destination or currency. Currencies offered as per attachment. This new cross-currency payments service will bring you convenience, efficiency, speed and cost savings and represents a part of our commitment to offering innovative and market-leading products and services. Please contact VTB Bank (Deutschland) AG's Moscow Representative Office for more details on this exciting development and any questions you may have on our ever-growing list of currencies and local country requirements. Sincerely,  VTB Bank (Deutschland) AG Frankfurt am Main"},
{"date": "Nov 25, 2011", "title": "Pressemitteilung zum 40jährigen Jubiläum der VTB Bank", "content": "VTB Bank (Deutschland) AG feiert 40-jähriges Bestehen Spezialbank für deutsch-russische Handelsgeschäfte blickt optimistisch in die Zukunft Mit dem 40-jährigen Firmenjubiläum begeht die VTB Bank (Deutschland) AG in Frankfurt einen Meilenstein in ihrer Unternehmensgeschichte. Die Geschichte der Spezialbank für deutsch-russische Handelsgeschäfte begann am 11. November 1971 mit der Gründung der Ost-West-Handelsbank AG, die im Jahr 2006 zur VTB Bank (Deutschland) AG umfirmierte. Über ihr Mutterunternehmen VTB Bank (Austria) AG ist die VTB (Deutschland) AG eingebunden in die börsennotierte VTB Gruppe, eine internationale Finanzholding, die sich im mehrheitlichen Besitz des russischen Staates befindet. Igor Strehl, Vorstandsvorsitzender der VTB Bank (Austria) AG, freut sich über das 40-jährige Jubiläum des deutschen Tochterunternehmens, das er selbst viele Jahre erfolgreich geführt hat, bevor er die Leitung der Europazentrale von Russlands größter Geschäftsbank übernahm. „Seit unserer Gründung vor 40 Jahren verstehen wir uns als Corporate Bank zwischen Ost und West.\", erklärt Igor Strehl aus Anlass des besonderen Unternehmens-Geburtstags. \"Die VTB ist spezialisiert auf Strukturierung und Finanzierung von Handelsbeziehungen und Projekten von und nach Russland sowie in die Gemeinschaft Unabhängiger Staaten (GUS). Ohne zu übertreiben kann man sagen, dass wir die schnellste Verbindung zwischen Ost und West darstellen, z.B. bei kurz- und mittelfristig strukturierten Handelsbeziehungen, Betriebsmittelfinanzierungen und Dokumentengeschäften in diesen Märkten.\" Für 2013 ist der Bezug eines neuen Firmengebäudes am Finanzplatz Frankfurt vorgesehen. Auf die Bedeutung dieser Investition verweist der Vorstandschef der VTB Bank (Deutschland) AG, Dr. Valeriy Lyakin und verknüpft die Historie des Unternehmens mit einem positiven Zukunftsausblick. „Die VTB Gruppe denkt wachstumsorientiert und langfristig, das soll ab 2013 auch nach außen deutlich werden. Unsere Kunden nehmen uns immer mehr als Global Player wahr, der nicht nur russische, sondern gleichermaßen auch deutsche sowie internationale Kunden anspricht.\", stellt Dr. Lyakin fest. „Mit dem Umzug in das neue Firmengebäude setzen wir ein sichtbares Zeichen, das unsere erfolgreiche Arbeit der letzten Jahre, aber auch die zukünftige Ausrichtung der Bank widerspiegelt.\" Dazu hat die VTB Bank (Deutschland) AG auch allen Grund: als Spezialbank für deutsch-russische Handelsbeziehungen verfügt das Institut über eine Bilanzsumme von über 4 Mrd. Euro und kann auf ein Gewinnwachstum von rund 30 Prozent über die vergangenen drei Jahre zurückblicken. Mit Verweis auf die Erfolgsdaten betont Dr. Lyakin: „Damit positioniert sich die VTB Bank (Deutschland) AG erfolgreich, stark und gut sichtbar im Markt und blickt voller Optimismus in die Zukunft.\" „Die VTB Bank (Deutschland) AG war eine der ersten ausländischen Banken, die sich in Frankfurt am Main niedergelassen haben. Diese Entscheidung hat den heutigen Ruf von Frankfurt am Main als Finanzplatz mit hohem internationalen Renommee begründet, \" sagt Wirtschaftsdezernent Markus Frank. „Bis heute trägt die VTB Bank (Deutschland) AG mit ihren Aktivitäten zu einer wirtschaftlich erfolgreichen Verbindung zwischen Deutschland und Russland bei.\" Die VTB Bank (Deutschland) AG verfügt über ein kontinuierlich gewachsenes Netz von mehr als 450 Korrespondenzbanken allein in Russland und der GUS, welches Zahlungen auch in die entlegensten Gebiete der GUS ermöglicht. Mit einer direkten Online-Verbindung zu ihren Kunden durch das bankeigene Electronic Banking-System, können Zahlungen schnell und sicher ausgeführt, sowie ein optimales Kontenmanagement rund um die Uhr gewährleistet werden. Als Clearing-Institut für Banken aus der Russischen Föderation und anderen GUS-Ländern spielt die VTB Bank (Deutschland) AG darüber hinaus eine bedeutende Rolle bei der Abwicklung von Zahlungsoperationen in allen konvertierbaren Währungen zwischen der Russischen Föderation, den anderen GUS-Staaten und den übrigen Ländern der Welt. Dazu stehen die elektronischen Nachrichtenübermittlungssysteme SWIFT und hauseigene Electronic Banking-Softwareprodukte zur Verfügung.  Zum Unternehmen: Die VTB Bank (Deutschland) AG ist eine Geschäfts- und Spezialbank für deutsch-russische Handelsbeziehungen. Seit 40 Jahren steht sie Unternehmen und Banken als kompetenter und zuverlässiger Partner bei der Abwicklung von Geschäften in Russland und der Gemeinschaft Unabhängiger Staaten (GUS) beratend und ausführend zur Seite. Die Bank verfügt über ein umfassendes Know-how und ist durch die marktspezifische Expertise, erstklassige Kontakte zum russischen Markt sowie kompetente Mitarbeitern in der Lage, gezielt und flexibel auf die Bedürfnisse Ihrer Kunden einzugehen. Die VTB Bank (Deutschland) AG ist Mitglied der an den Börsen London und Moskau notierten VTB Group, deren Kern die VTB Bank in Russland bildet. Die VTB Bank ist die zweitgrößte russische Bank und gilt als größte Außenhandelsbank der Russischen Föderation. Sie bietet neben der eigenen Fachkompetenz die Vorteile einer international agierenden Geschäftsbank. Die VTB Bank, die gemessen an der Bilanzsumme zu den 100 größten Banken der Welt gehört, verfügt über ein in ihrer geographischen Ausbreitung einzigartiges Netz von ca. 1.000 Filialen in Russland und zahlreichen Niederlassungen und Tochterunternehmen in den Staaten der GUS, in Europa und den Emerging Markets.  Kontakt: VTB Bank (Deutschland) AG Walter-Kolb-Str. 13 60594 Frankfurt am Main Telefon: +49 (69) 2168 - 288 E-Mail: presse@vtb.de"},
{"date": "Mar 31, 2012", "title": "Annual Report 2011", "content": "The Annual Report 2011 is now available asdownload."},
{"date": "Apr 01, 2012", "title": "VTB Bank (Deutschland) AG gratuliert VTB Direktbank", "content": "Die VTB Bank (Deutschland) AG gratuliert der VTB Direktbank zum erfolgreichen ersten Jahr im deutschen Privatkundenmarkt. Die VTB Direktbank ist als Zweigniederlassung der VTB Bank (Austria) AG im deutschen Privatkundenmarkt vertreten und blickt auf ein erfolgreiches erstes Geschäftsjahr zurück.  Beide Unternehmen - VTB Bank (Deutschland) AG und VTB Direktbank - gehören zur European Subholding der VTB Bank (Austria) AG in Wien. Während die VTB Bank (Deutschland) AG bereits seit über 40 Jahren als Spezial-Bank für deutsch-russische Handelsbeziehungen erfolgreich ist, konnte sich die im April 2011 gegründete VTB Direktbank innerhalb der vergangenen zwölf Monate zu einer festen Größe im deutschen Direktbankenmarkt entwickeln und hat sich in dieser kurzen Zeit als einer der führenden Anbieter von flexiblen Sparprodukten etabliert.  „Der VTB Direktbank ist es gelungen, sich schnell und nachhaltig im deutschen Retail-Markt zu etablieren\", freut sich Axel Breitbach, Vorstand der VTB Bank (Deutschland) AG, und ergänzt: „Die Strategie der VTB Direktbank, konsequent Neu- und Bestandskunden in allen kurz-, mittel- und langfristigen Laufzeiten attraktive Konditionen anzubieten, zahlt sich aus. Dies spiegelt sich auch in den positiven Bewertungen der Stiftung Warentest wider und dem Zuspruch seitens der Kunden. Wir gratulieren der VTB Direktbank ganz herzlich zu dieser positiven Entwicklung.\"  Im April 2011 startete die VTB Direktbank mit ihrem Tages- und Festgeld-Angebot. Seither wurde das Produktangebot kontinuierlich durch verschiedene Festgeld-Laufzeiten und individuelle Zinsauszahlungsrhythmen erweitert. So bietet die VTB Direktbank für sämtliche Festgeld-Laufzeiten jährliche oder monatliche Zinszahlungen an und kombiniert mit dem VTB Duo sogar die Vorzüge eines Tages- und Festgeldkontos  Im Großen Zinstest der Januar-Ausgabe 2012 der Zeitschrift Finanztest wurden die Angebote von 94 Banken bewertet - die VTB Direktbank überzeugte nicht nur als einer der Testsieger im Bereich „Festgeld/Sparbrief drei Jahre\", sondern auch in der Kategorie „Kombiprodukte\".  Aber auch die von der VTB Direktbank eingesetzte „Online-Filiale\" auf Basis des Bankensystems „bank21\" erfüllt überdurchschnittlich alle Kriterien für eine benutzerfreundliche Anwendung. Kunden der VTB Direktbank können ihre Transaktionen nicht nur sicher, sondern auch intuitiv, unkompliziert und schnell durchführen - offiziell bestätigt durch das Prüfsiegel des TÜV IT.  „Für uns zählt vor allem, dass wir unseren Kunden ein sicheres und unkompliziertes Online-Banking anbieten können.\", freut sich Bernd Hülsmann, Manager Operations & IT der VTB Direktbank. „Es zahlt sich aus, dass wir unsere online-Anwendungen täglich prüfen und im Sinne der Kunden optimieren. Das Prüfsiegel des TÜV IT gibt unseren Kunden dabei die Gewissheit, dass das Online-Banking der VTB Direktbank einfach, benutzerfreundlich und sicher ist.\"  Direktbanken gelten als die derzeitigen Gewinner im Bankenmarkt. In den letzten zehn Jahren erreichten Direktbanken in Deutschland mehr als 14 Millionen Kunden und einen Marktanteil bei den Sichteinlagen von 20 Prozent. Schon bald werden drei Viertel der Deutschen das Internet nutzen - und damit werden sie gleichzeitig zu potentiellen Kunden für Direktbanken. Experten prognostizieren weiteres Wachstum und erwarten zunehmenden Wettbewerb in den nächsten Jahren.  Magnus Eger, verantwortlich für das Marketing der VTB Direktbank, sieht dieser Entwicklung positiv entgegen: „Als auf attraktive und sichere Spareinlagen spezialisierte Online-Bank werden wir auch zukünftig versuchen, Sparer von unseren Angeboten zu überzeugen. Dazu benötigt man attraktive Produkte, einen schnellen und sicheren Service und eine solide Reputation - in allen Bereichen ist die VTB insgesamt bestens aufgestellt. Vor allem hat es sich für uns ausgezahlt, als neue Online-Bank eine offene und transparente Kommunikation mit unseren Kunden zu pflegen. Dazu gehört, dass die VTB Direktbank nicht nur gute Konditionen, sondern auch immer das ein oder andere Highlight anbietet - das Jubiläums-Startguthaben, die VTB Festgeldwochen und erst kürzlich das Oster-Spezial belegen diesen Ansatz.\"  Für 2013 ist sowohl für die VTB Bank (Deutschland) AG als auch für die VTB Direktbank der Bezug eines neuen Firmengebäudes am Finanzplatz Frankfurt vorgesehen. Auf die Bedeutung dieses Vorhabens verweist der Vorstandschef der VTB Bank (Deutschland) AG, Dr. Valeriy Lyakin und verknüpft die Historie des Unternehmens mit einem positiven Zukunftsausblick. „Die VTB Gruppe denkt wachstumsorientiert und langfristig, das soll ab 2013 auch nach außen deutlich werden. Unsere Kunden nehmen uns immer mehr als Global Player wahr, der gleichermaßen deutsche sowie internationale Kunden anspricht.\", stellt Dr. Lyakin fest. „Mit dem Umzug in das neue Firmengebäude setzen wir ein sichtbares Zeichen, das unsere erfolgreiche Arbeit der letzten Jahre, aber auch die zukünftige Ausrichtung der Bank widerspiegelt. Wir freuen uns, dass wir zusammen mit der VTB Direktbank die Kompetenzen aus Corporate und Retail Banking in einem gemeinsamen Firmengebäude vereinigen.\"  Michael Kramer, Niederlassungsleiter der VTB Direktbank blickt daher optimistisch in die Zukunft: \"Rückblickend dürfen wir mit unserem ersten Jahr sehr zufrieden sein. Die VTB Direktbank ist vor einem Jahr mit großem Interesse und ehrgeizigen Zielen an den deutschen Markt gekommen und möchte sich seither im deutschen Umfeld als ein verlässlicher Partner präsentieren. Eine der Kernausrichtungen der VTB Direktbank ist dabei der Aufbau von langfristigen Kundenbeziehungen, sowie eine professionelle und sehr zielorientierte Betreuung der Kunden. Wir haben es geschafft, die VTB Direktbank im deutschen Privatkundenmarkt zu etablieren und als führenden Anbieter für Online Sparprodukte zu positionieren.\"  Die VTB Direktbank auf einen Blick  Die VTB Direktbank ist eine Zweigniederlassung der österreichischen VTB Bank (Austria) AG. Als kosteneffiziente Onlinebank konzentriert sich die VTB Direktbank auf einfache, attraktive und sichere Sparprodukte.  Der Kundenservice der VTB Direktbank steht Anlegern an Werktagen zwischen 06.00-22.00 Uhr und an Wochenenden zwischen 09.00-14.00 Uhr telefonisch oder per E-Mail zur Verfügung. Die TÜV-zertifizierte Internet-Banking-Anwendung und das mobile TAN-Verfahren der VTB Direktbank entsprechen den höchsten Sicherheitsanforderungen im deutschen Markt.  Als Zweigniederlassung einer österreichischen Bank gehört die VTB Direktbank der Einlagensicherung der Banken & Bankiers GmbH in Österreich an (http://www.einlagensicherung.at)  Kontakt  VTB Bank (Austria) AG  Zweigniederlassung Deutschland, VTB Direktbank  Telefon:  +49 (69) 943 40 94 0  E-Mail:presse@vtbdirektbank.de"},
{"date": "Jul 12, 2012", "title": "VTB Bank (Deutschland) AG awarded as „Most Successful Bank 2012”", "content": "The Association of Russian Economy in Germany recognizes VTB Bank (Deutschland) AG for its contribution to the development of German-Russian economical relations. On June 28, 2012 the „Annual Congress Russia-Germany 2012\" took place in Berlin. The event was organized under the patronage of the Office of the Russian Federation for Trade and Economy, the Association of Russian Economy in Germany, the East-Committee of the Germany Economy, and Wegweiser Media & Conferences GmbH, Berlin. A broad spectrum of economic questions was discussed during the congress, among others, the prospects for the enhancement of the bilateral economical relations between the Russian Federation and the Federal Republic of Germany as well as the state of the global economy. Dr. Valeriy Lyakin, Chairman of the Management Board of VTB Bank (Deutschland) AG, participated in the forum „Financial Services\". This forum dealt with current and future issues with respect to development of export business, short- and mid-term financing, present investment climate in Russia, WTO-membership of the Russian Federation, developments of new products and wide-spread services, and solutions offered by banks. High-ranking representatives of politics, economy and science from both countries participated in this congress, for example; Mr. Vladimir Grinin (Ambassador of the Russian Federation in the Federal Republic of Germany), Mrs. Anne Ruth Herkes (State Secretary of the Federal Ministry of Economics and Technology), Mr. Alexey Likhachev (Vice Minister for Economic Development of the Russian Federation) as well as Mr. Michael Glos (Member of the German Federal Parliament, retired Federal Minister, Chairman of the curatorship for the Association of Russian Economy in Germany). At the conference's end, a prestigious awards ceremony was held by the Association of Russian Economy in Germany, during which VTB Bank (Deutschland) AG and Deutsche Bank AG were recognized with awards for their outstanding contributions to the development of the German-Russian economic relations within the category \"Most Successful Bank 2012\". Dr. Valeriy Lyakin as Chairman of the Management Board of VTB Bank (Deutschland) AG accepted the award. „VTB Bank (Deutschland) AG is the specialized bank for German-Russian trade relations.\" said Dr. Lyakin during his acknowledgement. „This award mirrors impressively the positive developments of the German-Russian economic relations during the last years. VTB Bank (Deutschland) AG has contributed its share to this development. We as a bank serve our customers by supporting their businesses in Russia and the CIS-countries. Without exaggeration it is fair to say that we are the fastest channel between East and West. The fact remains that our customer's demand for our expertise in the field of trade between East and West is increasing day by day. In this respect we pledge to remain a strong and flexible partner for our customers in the future.\" About the bank: VTB Bank (Deutschland) AG is a competent and reliable partner that provides advice to companies and banks on the settlement of transactions in Russia and the other CIS states. The experience that we have gained during 40 years as a German specialist bank for German-Russian trade relations, we consider ourselves to be the leading German bank in this segment. Our comprehensive market-specific expertise, excellent contacts with the Russian market and competent staff put us in a position to respond to our clients' needs in a precise, targeted and above all flexible manner. As a member of theVTB Group, with VTB Bank in Russia - the second largest bank and the largest foreign trade bank in the Russian federation - at its core, VTB Bank (Deutschland) AG offers the benefits of an internationally active commercial bank in addition to its own specialist expertise. VTB Bank, one of the 100 largest banks in the world in terms of capital, has a geographically unique network of around 1,000 branches in Russia, and many more in the CIS countries and Europe, in particular. Contact: VTB Bank (Deutschland) AG Walter-Kolb-Strasse 13 60594 Frankfurt am Main Phone: +49 (69) 2168 - 0 E-Mail:presse@vtb.de"},
{"date": "Jan 07, 2013", "title": "Successful arrangement and placing (as one of MLAs and Bookrunners) of the biggest so far syndicated loan dated November 30, 2012 for Moskovskiy Kreditniy Bank", "content": "PDF"},
{"date": "Jan 30, 2013", "title": "Embargoes and Sanctions – (in)solvable Problem for Banks?", "content": "See PDF file"},
{"date": "Jan 09, 2018", "title": "VTB Group completes restructuring of its European operations", "content": "On December 29, 2017, VTB Group completed restructuring of its European operations. VTB Bank (Austria) AG, VTB Bank (Deutschland) AG und VTB Bank (France) SA, were merged into the newly created VTB Bank (Europe) SE, which operates under a single banking license.  The decision to adopt an innovative legal form of SE or Societas Europaea — a company registered in accordance with the corporate law of the European Union, is consistent with VTB strategy in developing Group’s presence in Europe, VTB Group’s commitment to one of the core regions outside of Russia.  With the head office in Frankfurt am Main, the new structure will also include a branch in Vienna. VTB Direktbank will be part of the VTB Bank (Europe) SE. The office in Paris has been closed.  The merger process, including closure of the office in France and the registration of the branch in Austria, has been approved by the European Central Bank and the local regulators.  The reorganisation will lay the groundwork for a strategic realignment by the bank, in which a consistent legal, business and support infrastructure is created. This centralisation will allow the bank to make its entire product portfolio available to all clients across Europe, to attract the best talent to our bank and to optimise the resources. The cost savings of the restructuring will amount to approximately EUR40 mln annually (or approximately 40% of the current cost base). The new setup also enables significant efficiencies in managing liquidity and capital resources.  Yuri Soloviev, First Deputy President and Chairman of VTB Bank Management Board, said: \"We are the first Russian banking group and among the first banks in Europe to transform our organisational structure into that of a Societas Europaea or SE. This represents a clear commitment to Europe in general and to Frankfurt as its financial centre in particular. VTB Bank (Europe) SE is a universal bank with a focus on international clients, and we believe the merger will allow us to continue growing in this strategically important to VTB region.\""},
{"date": "Apr 06, 2018", "title": "VTB Bank (Europe) SE excluded from EU sanctions", "content": "Dear customers and business partners of our bank,  According to a decree/regulation published in the Official Journal of the European Union (L 229) on July 31, 2014, all units of VTB Bank, located in the European Union, are excluded from the application of sanctions on the basis of explicit solutions.  The legal merger on December 29, 2017 has no impact on sanctions and the business operations of VTB Bank (Europe) SE.  VTB Bank (Europe) SE is excluded from European sanctions. If you have any questions, please contact the person responsible for you entity.  Best regards Your VTB Bank (Europe) SE"},
{"date": "Apr 13, 2018", "title": "VTB Bank (Europe) SE opens new office in Vienna", "content": "On April 12, 2017, VTB Bank (Europe) SE opened its new office in Vienna. The Austrian branch moves into the new office in Wipplingerstrasse 35, in the first district of Vienna. This reallocation symbolizes the completion of the merger process of the European business. The event was celebrated with Austrian and CEE clients and senior management from VTB Group. The bank has been represented in Vienna for over 40 years.  The merger process laid down the groundwork for a strategic realignment by the bank in which a consistent legal, accounting and technical structure was created. This centralization will allow the bank to make its product portfolio available to all clients at each of its various locations. Management Board Chairman Arthur Iliyav stated as follows: “Nothing will change for our customers who were previously served from Austria. We have a very experienced team on site and continue to offer excellent services. Customers benefit from more efficient decision-making processes, a fast and modern infrastructure, improved banking expertise and access to VTB Group know-how.”  New branch location: VTB Bank (Europe) SE Branch Vienna (Zweigniederlassung Wien) Wipplingerstrasse 35/11 1010 Vienna"},
{"date": "Apr 05, 2019", "title": "VTBBank (Europe) SE launches VTB Invest", "content": "In January 2019, VTB Direktbank, a branch of VTBBank (Europe) SE, extended its product range with VTB Invest, a digital asset management solution. It offers clients interested in maximizing their savings an easy and low-cost access to professional portfolio management services, allowing them to make long-term investments in the capital market. In an online registration process, VTB Invest uses clients' individual preferences to offer them a portfolio comprised of exchange-traded index funds (ETFs). The funds can be conveniently purchased online through VTB Invest's state-of-the-art video identification procedure, so the client does not need to go to the post office, as is usually the case with these kinds of services. The product has a winning combination of broad diversification over various asset classes, attractive risk-return-characteristics and low barriers to entry. It is available with a monthly investment of EUR 50 and up or a one-time investment of EUR 500. The commission ranges between 1% and 1,2% per year depending on the investment volume. Clients can make further deposits, withdraw funds as per the conditions of the agreement or close the account at any time. Patrick Lehnert, responsible for the digital solution at VTBBank (Europe) SE, said: \"In times when interest rates are low, many investors long for products which offer the opportunity for higher returns. But many are wary of complexity, high management fees and fund expenses and investment risk which is difficult to assess. The idea behind VTB Invest is to offer our clients access to the capital markets under the easiest possible terms. This means keeping management fees and fund expenses for VTB Invest low, while allowing clients to select an ETF portfolio in a simple and well-explained way based on their risk appetite and helping them build up long-term capital.” VTB Invest reinforces VTB Direktbank’s product portfolio, which already includes simple investment products like fixed-interest deposits and overnight money. Learn more about VTB Invest at www.vtbdirekt-invest.de VTB Direktbank at a Glance VTB Direktbank is an independent branch of VTBBank (Europe) SE. As a cost-efficient online bank, VTB Direktbank focuses on simple, attractive and secure investment products, adding digital asset management to its product range in January 2019. VTBBank (Europe) SE, Zweigniederlassung Frankfurt am Main, is a member of the Compensation Scheme of German Private Banks."},
{"date": "Apr 12, 2019", "title": "VTB Bank (Europe) SE holds the Correspondent Banking Forum", "content": "On 28 March 2019, the 11th Correspondent Banking Forum was held by VTB Bank Europe in Moscow. The event is a platform for presenting new loan and financial products and payment transaction services VTB Bank Europe. The main objective of the Forum is to interact with customers effectively. About 200 guests took part in the Forum, including top government officials, representatives of Russian and foreign banks and financial institutions, management of VTB Bank Europe. A rich programme of the Forum is intended for discussion of a broad range of aspects of modern financial services industry. During key speakers’ presentations and panel discussions there was given an in-depth peer review of the most actual issues facing market participants.  The Forum started with the opening speech by Arthur Iliyav, Chairman of the Management Board of VTB Bank Europe. The session ‘Next Macro Economic & Financial Environment’ was attended by Igor Marich, Managing Director of FX, MM & Derivatives, Member of the Executive Board, Moscow Exchange and Dmitry Chernyadiev, Deputy Head of the Research, Analysis and Forecasting Department, Bank of Russia. Alexander Isakov, Chief economist, VTB Capital, moderated the session.  In continuation of the Forum, a Q&A session with Alexey Moiseev, Deputy Minister of Finance of the Russian Federation, was held.  During the panel session ‘Banking products’ presentations were made by Peter Petrik, Head of Credit, Leveraged Finance & Investments, VTB Bank Europe and Vitaly Andreev, Director, FX and Rates, VTB Bank Europe.  Special attention was paid to the advantages of VTB Bank Europe in terms of international settlements, trade financing and procedures for anti-money laundering and counter-terrorism financing (AML/CTF). The key speakers were Elvira Petrik, Senior Relationship Manager, Financial Institutions, VTB Bank Europe; Sascha Halllex, Head of International Payments, VTB Bank Europe, Viktor Luft, IT Application Manager, Business Applications, VTB Bank Europe, and Sebastian Glaab, Division Head of Compliance/AML/KYC, VTB Bank Europe.  VTB Bank (Europe) SE is part of the VTB Group, providing a wide range of services in frames of Corporate Investment Business (CIB)."},
{"date": "Jul 02, 2019", "title": "Maintenance notification", "content": "Dear Clients,  Please note that we will be performing server maintenance from 17:00 (GMT+2) July 2 2019 to 11:00 (GMT+2) July 3 2019. There may be short-term issues with access to the website, as well as to the information to be disclosed on it. From 11:01 (GMT+2) July 3 2019, the website will continue to operate normally.  We apologize for any inconvenience caused."},
{"date": "Oct 18, 2019", "title": "Maintenance notification", "content": "Dear Clients, Please note that we will be performing server maintenance from 22:00 (GMT+2) October 19 2019 to 08:00 (GMT+2) October 20 2019. There may be short-term issues with access to the website, as well as to the information to be disclosed on it. From 08:01 (GMT+2) October 20 2019, the website will continue to operate normally. We apologize for any inconvenience caused."},
{"date": "Jan 24, 2020", "title": "Maintenance notification", "content": "Dear Clients,Please note that we will be performing server maintenance January 25, 2020 from 08:00 (GMT+2) to 16:00 (GMT+2). There may be short-term issues with access to the website, as well as to the information to be disclosed on it. From 16:01 (GMT+2) January 25, 2020, the website will continue to operate normally.We apologize for any inconvenience caused."},
{"date": "Mar 18, 2020", "title": "Current special operation process against the Covid-19", "content": "Current special operation process against the Covid-19 Dear Partner: In the current situation, VTBBank (Europe) SE maintains business operations without interruption. All systems are working and we provide “Business as usual” level of functioning including product and client management. The Bank puts forward the contingency plan which secures business continuity.Our staff is able to work remotely with technical support guaranteed. The bank is using the recovery office for most critical operations. Our relationship managers are at your disposal as usual, a smooth cooperation between members of teams across the Bank is established. We would also like to assure you that we are always available to you as your partner in these special times and rely on your understanding. We appreciate your continuous support and cooperation.Management Board of VTBBank (Europe) SE"}
]